###### Please note that I've installed and used a virtual environment using pip. 
###### For the below code to work, please type "pipenv install" in the terminal and then "pipenv shell"

### Importing Pandas

In [1]:
import pandas as pd

### Reading the CSV file

In [2]:
Raw_Data = pd.read_csv("./Source.csv")

In [3]:
Raw_Data.head(2)

,Unnamed: 0,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,age,python_yn,R_yn,spark,aws,excel,job_simp,seniority,desc_len,num_comp
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 to 1000 employees,1973,...,47,1,0,0,0,1,data scientist,na,2536,0
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+ employees,1984,...,36,1,0,0,0,0,data scientist,na,4783,0

#### Deleting the Job Description Column

In [135]:
Raw_Data.drop(columns=['Job Description'], inplace=True)

In [136]:
Raw_Data.head(2)

,Unnamed: 0,Job Title,Salary Estimate,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,...,age,python_yn,R_yn,spark,aws,excel,job_simp,seniority,desc_len,num_comp
0,0,Data Scientist,$53K-$91K (Glassdoor est.),3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 to 1000 employees,1973,Company - Private,...,47,1,0,0,0,1,data scientist,na,2536,0
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+ employees,1984,Other Organization,...,36,1,0,0,0,0,data scientist,na,4783,0

##### Cleaning the unnecessary characters in the Company Name column. The \n may cause some issues in the Excel file later
##### Additionally, the numbers after \n appear to be rating numbers, which we already have in a column

In [137]:
##I am trying to separate the rows where the Company Name contains \n and does not contain it
with_n = Raw_Data["Company Name"][Raw_Data["Company Name"].str.contains(r'\n')]
without_n = Raw_Data["Company Name"][~Raw_Data["Company Name"].str.contains(r'\n')]

In [138]:
##Here, I am trying to find how many characters should be deleted in each cell, from the rows that contain \n
characters = (with_n.str.len() - with_n.str.find("\n"))

##By doing .unique() I am able to see if all the names have the \n at the end of the sentence or are the values 
##at different places throughout the rows. 
##Additionally, this also shows me how many characters do I need to delete from the names. 
characters.unique()

array([4], dtype=int64)

In [139]:
##Luckily, all the values equal 4, this means, that for all the rows the \n is at the same place, and 
##this is how many characters we have to delete.

deleted_n = Raw_Data["Company Name"][Raw_Data["Company Name"].str.contains(r'\n')].str[:-4]

##########Please Note###########
##This could've and should've been done using .replace(), however, after trying it, this method wasn't
##working as expected. Hence, the above approach

In [140]:
##Once we have removed \n and all the unnecessary characters to the right of it, we can simply
##map the new values to the existing column using index.

Raw_Data["Company Name"] = Raw_Data["Company Name"].index.map(deleted_n)

##### We have made all the necessary changes to save this DataFrame as a CSV and continue working on it using Excel

In [142]:
Raw_Data.to_csv('./Raw Data - Python Cleaned.csv')